Tekla.Structures.Analysis.AnalysisPosition.TypeEnum
The position types.

Tekla.Structures.Analysis.AnalysisPosition.TypeEnum.TYPE_NORMAL
The normal type.

Tekla.Structures.Analysis.AnalysisPosition.TypeEnum.TYPE_SPLIT
The split type.

Tekla.Structures.Analysis.AnalysisPosition.TypeEnum.TYPE_USER_SPLIT
The user split type.